markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_nvic.h
/**
 * \file
 * <!--
 * This file is part of BeRTOS.
 *
 * Bertos is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 *
 * As a special exception, you may use this file as part of a free software
 * library without restriction.  Specifically, if other files instantiate
 * templates or use macros or inline functions from this file, or you compile
 * this file and link it with other files to produce an executable, this
 * file does not by itself cause the resulting executable to be covered by
 * the GNU General Public License.  This exception does not however
 * invalidate any other reasons why the executable file might be covered by
 * the GNU General Public License.
 *
 * Copyright 2010 Develer S.r.l. (http://www.develer.com/)
 *
 * -->
 *
 * \brief LM3S1968 NVIC hardware.
 */

#ifndef LM3S_NVIC_H
#define LM3S_NVIC_H

/**
 * The following are defines for the NVIC register addresses.
 */
/*\{*/
#define NVIC_INT_TYPE           0xE000E004  ///< Interrupt Controller Type Reg
#define NVIC_ST_CTRL            0xE000E010  ///< SysTick Control and Status Reg
#define NVIC_ST_RELOAD          0xE000E014  ///< SysTick Reload Value Register
#define NVIC_ST_CURRENT         0xE000E018  ///< SysTick Current Value Register
#define NVIC_ST_CAL             0xE000E01C  ///< SysTick Calibration Value Reg
#define NVIC_EN0                0xE000E100  ///< IRQ 0 to 31 Set Enable Register
#define NVIC_EN1                0xE000E104  ///< IRQ 32 to 63 Set Enable Register
#define NVIC_DIS0               0xE000E180  ///< IRQ 0 to 31 Clear Enable Reg
#define NVIC_DIS1               0xE000E184  ///< IRQ 32 to 63 Clear Enable Reg
#define NVIC_PEND0              0xE000E200  ///< IRQ 0 to 31 Set Pending Register
#define NVIC_PEND1              0xE000E204  ///< IRQ 32 to 63 Set Pending Reg
#define NVIC_UNPEND0            0xE000E280  ///< IRQ 0 to 31 Clear Pending Reg
#define NVIC_UNPEND1            0xE000E284  ///< IRQ 32 to 63 Clear Pending Reg
#define NVIC_ACTIVE0            0xE000E300  ///< IRQ 0 to 31 Active Register
#define NVIC_ACTIVE1            0xE000E304  ///< IRQ 32 to 63 Active Register
#define NVIC_PRI0               0xE000E400  ///< IRQ 0 to 3 Priority Register
#define NVIC_PRI1               0xE000E404  ///< IRQ 4 to 7 Priority Register
#define NVIC_PRI2               0xE000E408  ///< IRQ 8 to 11 Priority Register
#define NVIC_PRI3               0xE000E40C  ///< IRQ 12 to 15 Priority Register
#define NVIC_PRI4               0xE000E410  ///< IRQ 16 to 19 Priority Register
#define NVIC_PRI5               0xE000E414  ///< IRQ 20 to 23 Priority Register
#define NVIC_PRI6               0xE000E418  ///< IRQ 24 to 27 Priority Register
#define NVIC_PRI7               0xE000E41C  ///< IRQ 28 to 31 Priority Register
#define NVIC_PRI8               0xE000E420  ///< IRQ 32 to 35 Priority Register
#define NVIC_PRI9               0xE000E424  ///< IRQ 36 to 39 Priority Register
#define NVIC_PRI10              0xE000E428  ///< IRQ 40 to 43 Priority Register
#define NVIC_PRI11              0xE000E42C  ///< IRQ 44 to 47 Priority Register
#define NVIC_PRI12              0xE000E430  ///< IRQ 48 to 51 Priority Register
#define NVIC_PRI13              0xE000E434  ///< IRQ 52 to 55 Priority Register
#define NVIC_CPUID              0xE000ED00  ///< CPUID Base Register
#define NVIC_INT_CTRL           0xE000ED04  ///< Interrupt Control State Register
#define NVIC_VTABLE             0xE000ED08  ///< Vector Table Offset Register
#define NVIC_APINT              0xE000ED0C  ///< App. Int & Reset Control Reg
#define NVIC_SYS_CTRL           0xE000ED10  ///< System Control Register
#define NVIC_CFG_CTRL           0xE000ED14  ///< Configuration Control Register
#define NVIC_SYS_PRI1           0xE000ED18  ///< Sys. Handlers 4 to 7 Priority
#define NVIC_SYS_PRI2           0xE000ED1C  ///< Sys. Handlers 8 to 11 Priority
#define NVIC_SYS_PRI3           0xE000ED20  ///< Sys. Handlers 12 to 15 Priority
#define NVIC_SYS_HND_CTRL       0xE000ED24  ///< System Handler Control and State
#define NVIC_FAULT_STAT         0xE000ED28  ///< Configurable Fault Status Reg
#define NVIC_HFAULT_STAT        0xE000ED2C  ///< Hard Fault Status Register
#define NVIC_DEBUG_STAT         0xE000ED30  ///< Debug Status Register
#define NVIC_MM_ADDR            0xE000ED34  ///< Mem Manage Address Register
#define NVIC_FAULT_ADDR         0xE000ED38  ///< Bus Fault Address Register
#define NVIC_MPU_TYPE           0xE000ED90  ///< MPU Type Register
#define NVIC_MPU_CTRL           0xE000ED94  ///< MPU Control Register
#define NVIC_MPU_NUMBER         0xE000ED98  ///< MPU Region Number Register
#define NVIC_MPU_BASE           0xE000ED9C  ///< MPU Region Base Address Register
#define NVIC_MPU_ATTR           0xE000EDA0  ///< MPU Region Attribute & Size Reg
#define NVIC_DBG_CTRL           0xE000EDF0  ///< Debug Control and Status Reg
#define NVIC_DBG_XFER           0xE000EDF4  ///< Debug Core Reg. Transfer Select
#define NVIC_DBG_DATA           0xE000EDF8  ///< Debug Core Register Data
#define NVIC_DBG_INT            0xE000EDFC  ///< Debug Reset Interrupt Control
#define NVIC_SW_TRIG            0xE000EF00  ///< Software Trigger Interrupt Reg
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_INT_TYPE register.
 */
/*\{*/
#define NVIC_INT_TYPE_LINES_M   0x0000001F  ///< Number of interrupt lines (x32)
#define NVIC_INT_TYPE_LINES_S   0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CTRL register.
 */
/*\{*/
#define NVIC_ST_CTRL_COUNT      0x00010000  ///< Count flag
#define NVIC_ST_CTRL_CLK_SRC    0x00000004  ///< Clock Source
#define NVIC_ST_CTRL_INTEN      0x00000002  ///< Interrupt enable
#define NVIC_ST_CTRL_ENABLE     0x00000001  ///< Counter mode
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_RELOAD register.
 */
/*\{*/
#define NVIC_ST_RELOAD_M        0x00FFFFFF  ///< Counter load value
#define NVIC_ST_RELOAD_S        0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CURRENT
 * register.
 */
/*\{*/
#define NVIC_ST_CURRENT_M       0x00FFFFFF  ///< Counter current value
#define NVIC_ST_CURRENT_S       0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CAL register.
 */
/*\{*/
#define NVIC_ST_CAL_NOREF       0x80000000  ///< No reference clock
#define NVIC_ST_CAL_SKEW        0x40000000  ///< Clock skew
#define NVIC_ST_CAL_ONEMS_M     0x00FFFFFF  ///< 1ms reference value
#define NVIC_ST_CAL_ONEMS_S     0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_EN0 register.
 */
/*\{*/
#define NVIC_EN0_INT31          0x80000000  ///< Interrupt 31 enable
#define NVIC_EN0_INT30          0x40000000  ///< Interrupt 30 enable
#define NVIC_EN0_INT29          0x20000000  ///< Interrupt 29 enable
#define NVIC_EN0_INT28          0x10000000  ///< Interrupt 28 enable
#define NVIC_EN0_INT27          0x08000000  ///< Interrupt 27 enable
#define NVIC_EN0_INT26          0x04000000  ///< Interrupt 26 enable
#define NVIC_EN0_INT25          0x02000000  ///< Interrupt 25 enable
#define NVIC_EN0_INT24          0x01000000  ///< Interrupt 24 enable
#define NVIC_EN0_INT23          0x00800000  ///< Interrupt 23 enable
#define NVIC_EN0_INT22          0x00400000  ///< Interrupt 22 enable
#define NVIC_EN0_INT21          0x00200000  ///< Interrupt 21 enable
#define NVIC_EN0_INT20          0x00100000  ///< Interrupt 20 enable
#define NVIC_EN0_INT19          0x00080000  ///< Interrupt 19 enable
#define NVIC_EN0_INT18          0x00040000  ///< Interrupt 18 enable
#define NVIC_EN0_INT17          0x00020000  ///< Interrupt 17 enable
#define NVIC_EN0_INT16          0x00010000  ///< Interrupt 16 enable
#define NVIC_EN0_INT15          0x00008000  ///< Interrupt 15 enable
#define NVIC_EN0_INT14          0x00004000  ///< Interrupt 14 enable
#define NVIC_EN0_INT13          0x00002000  ///< Interrupt 13 enable
#define NVIC_EN0_INT12          0x00001000  ///< Interrupt 12 enable
#define NVIC_EN0_INT11          0x00000800  ///< Interrupt 11 enable
#define NVIC_EN0_INT10          0x00000400  ///< Interrupt 10 enable
#define NVIC_EN0_INT9           0x00000200  ///< Interrupt 9 enable
#define NVIC_EN0_INT8           0x00000100  ///< Interrupt 8 enable
#define NVIC_EN0_INT7           0x00000080  ///< Interrupt 7 enable
#define NVIC_EN0_INT6           0x00000040  ///< Interrupt 6 enable
#define NVIC_EN0_INT5           0x00000020  ///< Interrupt 5 enable
#define NVIC_EN0_INT4           0x00000010  ///< Interrupt 4 enable
#define NVIC_EN0_INT3           0x00000008  ///< Interrupt 3 enable
#define NVIC_EN0_INT2           0x00000004  ///< Interrupt 2 enable
#define NVIC_EN0_INT1           0x00000002  ///< Interrupt 1 enable
#define NVIC_EN0_INT0           0x00000001  ///< Interrupt 0 enable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_EN1 register.
 */
/*\{*/
#define NVIC_EN1_INT59          0x08000000  ///< Interrupt 59 enable
#define NVIC_EN1_INT58          0x04000000  ///< Interrupt 58 enable
#define NVIC_EN1_INT57          0x02000000  ///< Interrupt 57 enable
#define NVIC_EN1_INT56          0x01000000  ///< Interrupt 56 enable
#define NVIC_EN1_INT55          0x00800000  ///< Interrupt 55 enable
#define NVIC_EN1_INT54          0x00400000  ///< Interrupt 54 enable
#define NVIC_EN1_INT53          0x00200000  ///< Interrupt 53 enable
#define NVIC_EN1_INT52          0x00100000  ///< Interrupt 52 enable
#define NVIC_EN1_INT51          0x00080000  ///< Interrupt 51 enable
#define NVIC_EN1_INT50          0x00040000  ///< Interrupt 50 enable
#define NVIC_EN1_INT49          0x00020000  ///< Interrupt 49 enable
#define NVIC_EN1_INT48          0x00010000  ///< Interrupt 48 enable
#define NVIC_EN1_INT47          0x00008000  ///< Interrupt 47 enable
#define NVIC_EN1_INT46          0x00004000  ///< Interrupt 46 enable
#define NVIC_EN1_INT45          0x00002000  ///< Interrupt 45 enable
#define NVIC_EN1_INT44          0x00001000  ///< Interrupt 44 enable
#define NVIC_EN1_INT43          0x00000800  ///< Interrupt 43 enable
#define NVIC_EN1_INT42          0x00000400  ///< Interrupt 42 enable
#define NVIC_EN1_INT41          0x00000200  ///< Interrupt 41 enable
#define NVIC_EN1_INT40          0x00000100  ///< Interrupt 40 enable
#define NVIC_EN1_INT39          0x00000080  ///< Interrupt 39 enable
#define NVIC_EN1_INT38          0x00000040  ///< Interrupt 38 enable
#define NVIC_EN1_INT37          0x00000020  ///< Interrupt 37 enable
#define NVIC_EN1_INT36          0x00000010  ///< Interrupt 36 enable
#define NVIC_EN1_INT35          0x00000008  ///< Interrupt 35 enable
#define NVIC_EN1_INT34          0x00000004  ///< Interrupt 34 enable
#define NVIC_EN1_INT33          0x00000002  ///< Interrupt 33 enable
#define NVIC_EN1_INT32          0x00000001  ///< Interrupt 32 enable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_DIS0 register.
 */
/*\{*/
#define NVIC_DIS0_INT31         0x80000000  ///< Interrupt 31 disable
#define NVIC_DIS0_INT30         0x40000000  ///< Interrupt 30 disable
#define NVIC_DIS0_INT29         0x20000000  ///< Interrupt 29 disable
#define NVIC_DIS0_INT28         0x10000000  ///< Interrupt 28 disable
#define NVIC_DIS0_INT27         0x08000000  ///< Interrupt 27 disable
#define NVIC_DIS0_INT26         0x04000000  ///< Interrupt 26 disable
#define NVIC_DIS0_INT25         0x02000000  ///< Interrupt 25 disable
#define NVIC_DIS0_INT24         0x01000000  ///< Interrupt 24 disable
#define NVIC_DIS0_INT23         0x00800000  ///< Interrupt 23 disable
#define NVIC_DIS0_INT22         0x00400000  ///< Interrupt 22 disable
#define NVIC_DIS0_INT21         0x00200000  ///< Interrupt 21 disable
#define NVIC_DIS0_INT20         0x00100000  ///< Interrupt 20 disable
#define NVIC_DIS0_INT19         0x00080000  ///< Interrupt 19 disable
#define NVIC_DIS0_INT18         0x00040000  ///< Interrupt 18 disable
#define NVIC_DIS0_INT17         0x00020000  ///< Interrupt 17 disable
#define NVIC_DIS0_INT16         0x00010000  ///< Interrupt 16 disable
#define NVIC_DIS0_INT15         0x00008000  ///< Interrupt 15 disable
#define NVIC_DIS0_INT14         0x00004000  ///< Interrupt 14 disable
#define NVIC_DIS0_INT13         0x00002000  ///< Interrupt 13 disable
#define NVIC_DIS0_INT12         0x00001000  ///< Interrupt 12 disable
#define NVIC_DIS0_INT11         0x00000800  ///< Interrupt 11 disable
#define NVIC_DIS0_INT10         0x00000400  ///< Interrupt 10 disable
#define NVIC_DIS0_INT9          0x00000200  ///< Interrupt 9 disable
#define NVIC_DIS0_INT8          0x00000100  ///< Interrupt 8 disable
#define NVIC_DIS0_INT7          0x00000080  ///< Interrupt 7 disable
#define NVIC_DIS0_INT6          0x00000040  ///< Interrupt 6 disable
#define NVIC_DIS0_INT5          0x00000020  ///< Interrupt 5 disable
#define NVIC_DIS0_INT4          0x00000010  ///< Interrupt 4 disable
#define NVIC_DIS0_INT3          0x00000008  ///< Interrupt 3 disable
#define NVIC_DIS0_INT2          0x00000004  ///< Interrupt 2 disable
#define NVIC_DIS0_INT1          0x00000002  ///< Interrupt 1 disable
#define NVIC_DIS0_INT0          0x00000001  ///< Interrupt 0 disable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_DIS1 register.
 */
/*\{*/
#define NVIC_DIS1_INT59         0x08000000  ///< Interrupt 59 disable
#define NVIC_DIS1_INT58         0x04000000  ///< Interrupt 58 disable
#define NVIC_DIS1_INT57         0x02000000  ///< Interrupt 57 disable
#define NVIC_DIS1_INT56         0x01000000  ///< Interrupt 56 disable
#define NVIC_DIS1_INT55         0x00800000  ///< Interrupt 55 disable
#define NVIC_DIS1_INT54         0x00400000  ///< Interrupt 54 disable
#define NVIC_DIS1_INT53         0x00200000  ///< Interrupt 53 disable
#define NVIC_DIS1_INT52         0x00100000  ///< Interrupt 52 disable
#define NVIC_DIS1_INT51         0x00080000  ///< Interrupt 51 disable
#define NVIC_DIS1_INT50         0x00040000  ///< Interrupt 50 disable
#define NVIC_DIS1_INT49         0x00020000  ///< Interrupt 49 disable
#define NVIC_DIS1_INT48         0x00010000  ///< Interrupt 48 disable
#define NVIC_DIS1_INT47         0x00008000  ///< Interrupt 47 disable
#define NVIC_DIS1_INT46         0x00004000  ///< Interrupt 46 disable
#define NVIC_DIS1_INT45         0x00002000  ///< Interrupt 45 disable
#define NVIC_DIS1_INT44         0x00001000  ///< Interrupt 44 disable
#define NVIC_DIS1_INT43         0x00000800  ///< Interrupt 43 disable
#define NVIC_DIS1_INT42         0x00000400  ///< Interrupt 42 disable
#define NVIC_DIS1_INT41         0x00000200  ///< Interrupt 41 disable
#define NVIC_DIS1_INT40         0x00000100  ///< Interrupt 40 disable
#define NVIC_DIS1_INT39         0x00000080  ///< Interrupt 39 disable
#define NVIC_DIS1_INT38         0x00000040  ///< Interrupt 38 disable
#define NVIC_DIS1_INT37         0x00000020  ///< Interrupt 37 disable
#define NVIC_DIS1_INT36         0x00000010  ///< Interrupt 36 disable
#define NVIC_DIS1_INT35         0x00000008  ///< Interrupt 35 disable
#define NVIC_DIS1_INT34         0x00000004  ///< Interrupt 34 disable
#define NVIC_DIS1_INT33         0x00000002  ///< Interrupt 33 disable
#define NVIC_DIS1_INT32         0x00000001  ///< Interrupt 32 disable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_PEND0 register.
 */
/*\{*/
#define NVIC_PEND0_INT31        0x80000000  ///< Interrupt 31 pend
#define NVIC_PEND0_INT30        0x40000000  ///< Interrupt 30 pend
#define NVIC_PEND0_INT29        0x20000000  ///< Interrupt 29 pend
#define NVIC_PEND0_INT28        0x10000000  ///< Interrupt 28 pend
#define NVIC_PEND0_INT27        0x08000000  ///< Interrupt 27 pend
#define NVIC_PEND0_INT26        0x04000000  ///< Interrupt 26 pend
#define NVIC_PEND0_INT25        0x02000000  ///< Interrupt 25 pend
#define NVIC_PEND0_INT24        0x01000000  ///< Interrupt 24 pend
#define NVIC_PEND0_INT23        0x00800000  ///< Interrupt 23 pend
#define NVIC_PEND0_INT22        0x00400000  ///< Interrupt 22 pend
#define NVIC_PEND0_INT21        0x00200000  ///< Interrupt 21 pend
#define NVIC_PEND0_INT20        0x00100000  ///< Interrupt 20 pend
#define NVIC_PEND0_INT19        0x00080000  ///< Interrupt 19 pend
#define NVIC_PEND0_INT18        0x00040000  ///< Interrupt 18 pend
#define NVIC_PEND0_INT17        0x00020000  ///< Interrupt 17 pend
#define NVIC_PEND0_INT16        0x00010000  ///< Interrupt 16 pend
#define NVIC_PEND0_INT15        0x00008000  ///< Interrupt 15 pend
#define NVIC_PEND0_INT14        0x00004000  ///< Interrupt 14 pend
#define NVIC_PEND0_INT13        0x00002000  ///< Interrupt 13 pend
#define NVIC_PEND0_INT12        0x00001000  ///< Interrupt 12 pend
#define NVIC_PEND0_INT11        0x00000800  ///< Interrupt 11 pend
#define NVIC_PEND0_INT10        0x00000400  ///< Interrupt 10 pend
#define NVIC_PEND0_INT9         0x00000200  ///< Interrupt 9 pend
#define NVIC_PEND0_INT8         0x00000100  ///< Interrupt 8 pend
#define NVIC_PEND0_INT7         0x00000080  ///< Interrupt 7 pend
#define NVIC_PEND0_INT6         0x00000040  ///< Interrupt 6 pend
#define NVIC_PEND0_INT5         0x00000020  ///< Interrupt 5 pend
#define NVIC_PEND0_INT4         0x00000010  ///< Interrupt 4 pend
#define NVIC_PEND0_INT3         0x00000008  ///< Interrupt 3 pend
#define NVIC_PEND0_INT2         0x00000004  ///< Interrupt 2 pend
#define NVIC_PEND0_INT1         0x00000002  ///< Interrupt 1 pend
#define NVIC_PEND0_INT0         0x00000001  ///< Interrupt 0 pend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_PEND1 register.
 */
/*\{*/
#define NVIC_PEND1_INT59        0x08000000  ///< Interrupt 59 pend
#define NVIC_PEND1_INT58        0x04000000  ///< Interrupt 58 pend
#define NVIC_PEND1_INT57        0x02000000  ///< Interrupt 57 pend
#define NVIC_PEND1_INT56        0x01000000  ///< Interrupt 56 pend
#define NVIC_PEND1_INT55        0x00800000  ///< Interrupt 55 pend
#define NVIC_PEND1_INT54        0x00400000  ///< Interrupt 54 pend
#define NVIC_PEND1_INT53        0x00200000  ///< Interrupt 53 pend
#define NVIC_PEND1_INT52        0x00100000  ///< Interrupt 52 pend
#define NVIC_PEND1_INT51        0x00080000  ///< Interrupt 51 pend
#define NVIC_PEND1_INT50        0x00040000  ///< Interrupt 50 pend
#define NVIC_PEND1_INT49        0x00020000  ///< Interrupt 49 pend
#define NVIC_PEND1_INT48        0x00010000  ///< Interrupt 48 pend
#define NVIC_PEND1_INT47        0x00008000  ///< Interrupt 47 pend
#define NVIC_PEND1_INT46        0x00004000  ///< Interrupt 46 pend
#define NVIC_PEND1_INT45        0x00002000  ///< Interrupt 45 pend
#define NVIC_PEND1_INT44        0x00001000  ///< Interrupt 44 pend
#define NVIC_PEND1_INT43        0x00000800  ///< Interrupt 43 pend
#define NVIC_PEND1_INT42        0x00000400  ///< Interrupt 42 pend
#define NVIC_PEND1_INT41        0x00000200  ///< Interrupt 41 pend
#define NVIC_PEND1_INT40        0x00000100  ///< Interrupt 40 pend
#define NVIC_PEND1_INT39        0x00000080  ///< Interrupt 39 pend
#define NVIC_PEND1_INT38        0x00000040  ///< Interrupt 38 pend
#define NVIC_PEND1_INT37        0x00000020  ///< Interrupt 37 pend
#define NVIC_PEND1_INT36        0x00000010  ///< Interrupt 36 pend
#define NVIC_PEND1_INT35        0x00000008  ///< Interrupt 35 pend
#define NVIC_PEND1_INT34        0x00000004  ///< Interrupt 34 pend
#define NVIC_PEND1_INT33        0x00000002  ///< Interrupt 33 pend
#define NVIC_PEND1_INT32        0x00000001  ///< Interrupt 32 pend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_UNPEND0 register.
 */
/*\{*/
#define NVIC_UNPEND0_INT31      0x80000000  ///< Interrupt 31 unpend
#define NVIC_UNPEND0_INT30      0x40000000  ///< Interrupt 30 unpend
#define NVIC_UNPEND0_INT29      0x20000000  ///< Interrupt 29 unpend
#define NVIC_UNPEND0_INT28      0x10000000  ///< Interrupt 28 unpend
#define NVIC_UNPEND0_INT27      0x08000000  ///< Interrupt 27 unpend
#define NVIC_UNPEND0_INT26      0x04000000  ///< Interrupt 26 unpend
#define NVIC_UNPEND0_INT25      0x02000000  ///< Interrupt 25 unpend
#define NVIC_UNPEND0_INT24      0x01000000  ///< Interrupt 24 unpend
#define NVIC_UNPEND0_INT23      0x00800000  ///< Interrupt 23 unpend
#define NVIC_UNPEND0_INT22      0x00400000  ///< Interrupt 22 unpend
#define NVIC_UNPEND0_INT21      0x00200000  ///< Interrupt 21 unpend
#define NVIC_UNPEND0_INT20      0x00100000  ///< Interrupt 20 unpend
#define NVIC_UNPEND0_INT19      0x00080000  ///< Interrupt 19 unpend
#define NVIC_UNPEND0_INT18      0x00040000  ///< Interrupt 18 unpend
#define NVIC_UNPEND0_INT17      0x00020000  ///< Interrupt 17 unpend
#define NVIC_UNPEND0_INT16      0x00010000  ///< Interrupt 16 unpend
#define NVIC_UNPEND0_INT15      0x00008000  ///< Interrupt 15 unpend
#define NVIC_UNPEND0_INT14      0x00004000  ///< Interrupt 14 unpend
#define NVIC_UNPEND0_INT13      0x00002000  ///< Interrupt 13 unpend
#define NVIC_UNPEND0_INT12      0x00001000  ///< Interrupt 12 unpend
#define NVIC_UNPEND0_INT11      0x00000800  ///< Interrupt 11 unpend
#define NVIC_UNPEND0_INT10      0x00000400  ///< Interrupt 10 unpend
#define NVIC_UNPEND0_INT9       0x00000200  ///< Interrupt 9 unpend
#define NVIC_UNPEND0_INT8       0x00000100  ///< Interrupt 8 unpend
#define NVIC_UNPEND0_INT7       0x00000080  ///< Interrupt 7 unpend
#define NVIC_UNPEND0_INT6       0x00000040  ///< Interrupt 6 unpend
#define NVIC_UNPEND0_INT5       0x00000020  ///< Interrupt 5 unpend
#define NVIC_UNPEND0_INT4       0x00000010  ///< Interrupt 4 unpend
#define NVIC_UNPEND0_INT3       0x00000008  ///< Interrupt 3 unpend
#define NVIC_UNPEND0_INT2       0x00000004  ///< Interrupt 2 unpend
#define NVIC_UNPEND0_INT1       0x00000002  ///< Interrupt 1 unpend
#define NVIC_UNPEND0_INT0       0x00000001  ///< Interrupt 0 unpend
/*\}*/

